Repository: shymkohome-del/clawd-config
Catalog: crypto_market/lib/l10n/app_*.arb
Languages: lv

# appTitle
source: Crypto Market
lv: Kripto tirgus

# registerTitle
source: Register
lv: Reģistrēties

# emailLabel
source: Email
lv: E-pasts

# emailRequired
source: Email is required
lv: E-pasts ir obligāts

# emailInvalid
source: Enter a valid email
lv: Ievadiet derīgu e-pastu

# usernameLabel
source: Username
lv: Lietotājvārds

# usernameRequired
source: Username is required
lv: Lietotājvārds ir obligāts

# usernameMinLength
source: Min length 3
lv: Minimālais garums 3

# usernameMaxLength
source: Max length 30
lv: Maksimālais garums 30

# usernameInvalidChars
source: Only letters, numbers, _ and - allowed
lv: Atļauti tikai burti, cipari, _ un -

# passwordLabel
source: Password
lv: Parole

# passwordRequired
source: Password is required
lv: Parole ir obligāta

# passwordMinLength
source: Min length 8
lv: Minimālais garums 8

source: Create account
lv: Izveidot kontu

source: Continue with Google
lv: Turpināt ar Google

source: Continue with Apple
lv: Turpināt ar Apple

# errorInvalidCredentials
source: Invalid credentials
lv: Nederīgi akreditācijas dati

# errorOAuthDenied
source: OAuth denied or cancelled
lv: OAuth noraidīts vai atcelts

# errorNetwork
source: Network error. Please try again
lv: Tīkla kļūda. Lūdzu mēģiniet vēlreiz

# errorUnknown
source: Something went wrong
lv: Radās kļūda

# errorImagePicker
source: Error selecting image
lv: Kļūda attēla izvēlē

# homeTitle
source: Home
lv: Sākums

# loginTitle
source: Login
lv: Pieteikšanās

source: Go to Register
lv: Doties uz reģistrāciju

# languageEnglish
source: English
lv: Angļu

# languageLatvian
source: Latvian
lv: Latviešu

# languageSystem
source: System
lv: Sistēma

# configErrorTitle
source: Configuration Error
lv: Konfigurācijas kļūda

source: Profile
lv: Profils

source: Username
lv: Lietotājvārds

source: Email
lv: E-pasts

source: Auth Provider
lv: Autentifikācijas sniedzējs

source: Select Image Source
lv: Izvēlieties attēla avotu

source: Gallery
lv: Galerija

source: Camera
lv: Kamera

source: Retry
lv: Mēģināt vēlreiz

source: Updating profile...
lv: Atjaunina profilu...

# profileUpdatedSuccess
source: Profile updated successfully
lv: Profils veiksmīgi atjaunots

source: Logout
lv: Iziet

source: Session restored
lv: Sesija atjaunota

# sessionExpired
source: Session expired, please login again
lv: Sesijas laiks beidzies, lūdzu pieteikšanās vēlreiz

# editListingTitle
source: Edit Listing
lv: Rediģēt sludinājumu

# listingTitleLabel
source: Title
lv: Nosaukums

# priceLabel
source: Price
lv: Cena

# titleRequired
source: Title is required
lv: Nosaukums ir obligāts

# priceRequired
source: Price is required
lv: Cena ir obligāta

# pricePositive
source: Price must be greater than 0
lv: Cenai jābūt lielākai par 0

source: Replace Image
lv: Mainīt attēlu

# confirmUpdateTitle
source: Update Listing?
lv: Atjaunināt sludinājumu?

# confirmUpdateMessage
source: Are you sure you want to update this listing?
lv: Vai tiešām vēlaties atjaunināt šo sludinājumu?

# confirmUpdateYes
source: Update
lv: Atjaunināt

# confirmUpdateNo
source: Cancel
lv: Atcelt

source: Save Changes
lv: Saglabāt izmaiņas

# editSuccess
source: Listing updated successfully
lv: Sludinājums veiksmīgi atjaunināts

# editFailure
source: Failed to update listing
lv: Neizdevās atjaunināt sludinājumu

source: OK
lv: Labi

# errorTitleAuthentication
source: Authentication Error
lv: Autentifikācijas kļūda

# errorTitleConnection
source: Connection Error
lv: Savienojuma kļūda

# errorTitleInvalidInput
source: Invalid Input
lv: Nederīga ievade

# errorTitleOperation
source: Operation Error
lv: Operācijas kļūda

# errorTitleGeneric
source: Error
lv: Kļūda

# errorAuthInvalidCredentials
source: Invalid email or password
lv: Nederīgs e-pasts vai parole

# errorAuthUserNotFound
source: User not found
lv: Lietotājs nav atrasts

# errorAuthEmailExists
source: An account with this email already exists
lv: Konts ar šo e-pastu jau pastāv

# errorAuthWeakPassword
source: Password is too weak
lv: Parole ir pārāk vāja

# errorAuthAccountLocked
source: Account is temporarily locked
lv: Konts ir īslaicīgi bloķēts

# errorAuthSessionExpired
source: Your session has expired. Please log in again
lv: Sesijas laiks beidzies. Lūdzu piesakieties vēlreiz

# errorAuthInvalidToken
source: Invalid authentication token
lv: Nederīgs autentifikācijas marķieris

# errorAuthPrincipalMismatch
source: Principal mismatch in ICP authentication
lv: ICP autentifikācijas principal neatbilst

# errorAuthRegistrationFailed
source: Registration failed. Please try again
lv: Reģistrācija neizdevās. Lūdzu mēģiniet vēlreiz

# errorAuthLoginFailed
source: Login failed
lv: Pieteikšanās neizdevās

# errorAuthInsufficientPrivileges
source: Insufficient privileges to perform this action
lv: Nepietiekamas privilēģijas šai darbībai

# errorNetworkConnectionTimeout
source: Connection timeout. Please check your internet connection
lv: Savienojuma taimauts. Lūdzu pārbaudiet interneta savienojumu

# errorNetworkNoInternet
source: No internet connection available
lv: Nav pieejams interneta savienojums

# errorNetworkServerError
source: Server error occurred
lv: Radās servera kļūda

# errorNetworkCanisterUnavailable
source: ICP canister is currently unavailable
lv: ICP kanistrs pašlaik nav pieejams

# errorNetworkRateLimitExceeded
source: Too many requests. Please wait and try again
lv: Pārāk daudz pieprasījumu. Lūdzu uzgaidiet un mēģiniet vēlreiz

# errorNetworkInvalidResponse
source: Invalid response from server
lv: Nederīga servera atbilde

# errorNetworkRequestFailed
source: Request failed
lv: Pieprasījums neizdevās

# errorValidationRequired
source: {field} is required
lv: {field} ir obligāts

# errorValidationFormat
source: {field} format is invalid
lv: {field} formāts ir nederīgs

# errorValidationLength
source: {field} length is invalid
lv: {field} garums ir nederīgs

# errorValidationRange
source: {field} is out of range
lv: {field} ir ārpus diapazona

# errorBusinessInsufficientBalance
source: Insufficient balance for this transaction
lv: Nepietiekams atlikums šim darījumam

# errorBusinessMarketClosed
source: Market is currently closed
lv: Tirgus pašlaik ir slēgts

# errorBusinessInvalidOperation
source: This operation is not allowed
lv: Šī darbība nav atļauta

# errorBusinessRateLimitExceeded
source: Rate limit exceeded. Please try again later
lv: Pieprasījumu limits pārsniegts. Lūdzu mēģiniet vēlāk

# successGeneric
source: Operation completed successfully
lv: Darbība veiksmīgi pabeigta

# createListingTitle
source: Create Listing
lv: Izveidot sludinājumu

# descriptionLabel
source: Description
lv: Apraksts

# categoryLabel
source: Category
lv: Kategorija

# conditionLabel
source: Condition
lv: Stāvoklis

# locationLabel
source: Location
lv: Atrašanās vieta

# cryptoTypeLabel
source: Crypto Currency
lv: Kriptovalūta

# shippingOptionsLabel
source: Shipping Options
lv: Piegādes iespējas

# imagesLabel
source: Images
lv: Attēli

# conditionNew
source: New
lv: Jauns

# conditionUsed
source: Used
lv: Lietots

# conditionRefurbished
source: Refurbished
lv: Atjaunots

source: Add Images
lv: Pievienot attēlus

source: Remove Image
lv: Noņemt attēlu

# descriptionRequired
source: Description is required
lv: Apraksts ir obligāts

# categoryRequired
source: Category is required
lv: Kategorija ir obligāta

# locationRequired
source: Location is required
lv: Atrašanās vieta ir obligāta

# cryptoTypeRequired
source: Cryptocurrency is required
lv: Kriptovalūta ir obligāta

# shippingOptionsRequired
source: At least one shipping option is required
lv: Vismaz viena piegādes iespēja ir obligāta

source: Create Listing
lv: Izveidot sludinājumu

source: Creating...
lv: Izveido...

# listingCreatedSuccess
source: Listing created successfully!
lv: Sludinājums veiksmīgi izveidots!

# listingCreatedFailure
source: Failed to create listing
lv: Neizdevās izveidot sludinājumu

# descriptionHint
source: Describe your item in detail...
lv: Aprakstiet savu preci detalizēti...

# titleHint
source: What are you selling?
lv: Ko jūs pārdodat?

# locationHint
source: City, State/Country
lv: Pilsēta, Valsts/Reģions

source: Add shipping option
lv: Pievienot piegādes iespēju

source: Uploading images...
lv: Augšupielādē attēlus...

source: Image upload failed
lv: Attēla augšupielāde neizdevās

# searchListingsTitle
source: Browse Listings
lv: Pārlūkot sludinājumus

# searchPlaceholder
source: Search listings by keyword
lv: Meklēt sludinājumus pēc atslēgvārdiem

# searchFieldLabel
source: Search
lv: Meklēt

# filtersTitle
source: Filters
lv: Filtri

# filterPriceMin
source: Min price (USD)
lv: Min. cena (USD)

# filterPriceMax
source: Max price (USD)
lv: Maks. cena (USD)

# filterLocationLabel
source: Location
lv: Atrašanās vieta

# filterConditionLabel
source: Condition
lv: Stāvoklis

# filterSortLabel
source: Sort by
lv: Kārtot pēc

# filtersApply
source: Apply filters
lv: Pielietot filtrus

# filtersClear
source: Clear filters
lv: Notīrīt filtrus

source: Filters applied
lv: Filtri piemēroti

source: Filters cleared
lv: Filtri notīrīti

# searchNoResults
source: No listings match your filters yet. Adjust your search or try again later.
lv: Nevienam sludinājumam neatbilst izvēlētie filtri. Precizējiet meklēšanu vai mēģiniet vēlreiz.

# sortNewest
source: Newest first
lv: Jaunākie sākumā

# sortPriceLowHigh
source: Price: Low to High
lv: Cena: no zemākās uz augstāko

# sortPriceHighLow
source: Price: High to Low
lv: Cena: no augstākās uz zemāko

# listingDetailTitle
source: Listing Details
lv: Sludinājuma informācija

source: Contact Seller
lv: Sazināties ar pārdevēju

source: Report Listing
lv: Ziņot par sludinājumu

source: Share Listing
lv: Kopīgot sludinājumu

# sellerInfo
source: Seller Information
lv: Pārdevēja informācija

# sellerReputation
source: Reputation
lv: Reputācija

# sellerLocation
source: Location
lv: Atrašanās vieta

source: Member since
lv: Biedrs kopš

source: View Profile
lv: Skatīt profilu

source: No images available
lv: Attēli nav pieejami

source: Image Gallery
lv: Attēlu galerija

source: Previous
lv: Iepriekšējais

source: Next
lv: Nākamais

# imageOf
source: of
lv: no

source: Loading listing...
lv: Ielādē sludinājumu...

source: Listing not found
lv: Sludinājums nav atrasts

source: Error loading listing
lv: Kļūda ielādējot sludinājumu

source: Buy Now
lv: Pirkt tagad

# categoryElectronics
source: Electronics
lv: Elektronika

# categoryFashion
source: Fashion
lv: Mode

# categoryHomeGarden
source: Home & Garden
lv: Māja un dārzs

# categoryBooks
source: Books
lv: Grāmatas

# categoryAutomotive
source: Automotive
lv: Auto

# categoryCollectibles
source: Collectibles
lv: Kolekcijas

# categoryOther
source: Other
lv: Cits

source: Payment Methods
lv: Maksājumu Metodes

source: Manage Payment Methods
lv: Pārvaldīt Maksājumu Metodes

# paymentMethodsDescription
source: Add and manage your payment methods for secure transactions.
lv: Pievienojiet un pārvaldiet savas maksājumu metodes drošām transakcijām.

source: Add Payment Method
lv: Pievienot Maksājuma Metodi

source: Edit Payment Method
lv: Rediģēt Maksājuma Metodi

source: No Payment Methods
lv: Nav Maksājumu Metožu

# addPaymentMethodPrompt
source: Add a payment method to start making secure transactions.
lv: Pievienojiet maksājuma metodi, lai sāktu veikt drošas transakcijas.

source: Select Payment Type
lv: Izvēlieties Maksājuma Veidu

source: Bank Transfer
lv: Bankas Pārskaitījums

# bankTransferDescription
source: Direct bank to bank transfer
lv: Tiešs pārskaitījums no bankas uz banku

source: Digital Wallet
lv: Digitālais Maciņš

# digitalWalletDescription
source: PayPal, Wise, Venmo, etc.
lv: PayPal, Wise, Venmo, utt.

source: Cash
lv: Skaidra Nauda

# cashDescription
source: In-person cash payment
lv: Tikšanās ar skaidras naudas maksājumu

source: Account Number
lv: Konta Numurs

# accountNumberHint
source: Enter your account number
lv: Ievadiet konta numuru

# accountNumberRequired
source: Account number is required
lv: Konta numurs ir obligāts

source: Routing Number
lv: Maršrutēšanas Numurs

# routingNumberHint
source: Enter routing number
lv: Ievadiet maršrutēšanas numuru

# routingNumberRequired
source: Routing number is required
lv: Maršrutēšanas numurs ir obligāts

source: Account Holder Name
lv: Konta Īpašnieka Vārds

# accountHolderNameHint
source: Enter account holder name
lv: Ievadiet konta īpašnieka vārdu

# accountHolderNameRequired
source: Account holder name is required
lv: Konta īpašnieka vārds ir obligāts

source: Bank Name
lv: Bankas Nosaukums

# bankNameHint
source: Enter bank name
lv: Ievadiet bankas nosaukumu

# bankNameRequired
source: Bank name is required
lv: Bankas nosaukums ir obligāts

source: SWIFT Code
lv: SWIFT Kods

# swiftCodeHint
source: Enter SWIFT/BIC code (optional)
lv: Ievadiet SWIFT/BIC kodu (neobligāts)

# ibanHint
source: Enter IBAN number (optional)
lv: Ievadiet IBAN numuru (neobligāts)

source: Wallet ID
lv: Maciņa ID

# walletIdHint
source: Enter wallet ID or email
lv: Ievadiet maciņa ID vai e-pastu

# walletIdRequired
source: Wallet ID is required
lv: Maciņa ID ir obligāts

source: Provider
lv: Pakalpojuma Sniedzējs

# providerHint
source: e.g., PayPal, Wise, Venmo
lv: piem., PayPal, Wise, Venmo

# providerRequired
source: Provider is required
lv: Pakalpojuma sniedzējs ir obligāts

# emailHint
source: Enter email address
lv: Ievadiet e-pasta adresi

source: Phone Number
lv: Tālruņa Numurs

# phoneNumberHint
source: Enter phone number
lv: Ievadiet tālruņa numuru

source: Account Name
lv: Konta Nosaukums

# accountNameHint
source: Enter account name (optional)
lv: Ievadiet konta nosaukumu (neobligāts)

source: Meeting Location
lv: Tikšanās Vieta

# meetingLocationHint
source: Enter meeting location
lv: Ievadiet tikšanās vietu

# meetingLocationRequired
source: Meeting location is required
lv: Tikšanās vieta ir obligāta

source: Preferred Time
lv: Vēlamais Laiks

# preferredTimeHint
source: Enter preferred meeting time
lv: Ievadiet vēlamo tikšanās laiku

# preferredTimeRequired
source: Preferred time is required
lv: Vēlamais laiks ir obligāts

# contactInfo
source: Contact Information
lv: Kontaktinformācija

# contactInfoHint
source: Email or phone number
lv: E-pasts vai tālruņa numurs

# contactInfoRequired
source: Contact information is required
lv: Kontaktinformācija ir obligāta

source: Special Instructions
lv: Speciālas Norādes

# specialInstructionsHint
source: Any special requirements (optional)
lv: Īpašas prasības (neobligāts)

source: Optional
lv: Neobligāts

source: Cancel
lv: Atcelt

source: Save
lv: Saglabāt

source: Edit
lv: Rediģēt

source: Delete
lv: Dzēst

source: Delete Payment Method
lv: Dzēst Maksājuma Metodi

# deletePaymentMethodConfirmation
source: Are you sure you want to delete this payment method? This action cannot be undone.
lv: Vai tiešām vēlaties dzēst šo maksājuma metodi? Šī darbība ir neatgriezeniska.

source: Verified
lv: Apstiprināts

source: Pending
lv: Gaida apstiprinājumu

source: Rejected
lv: Noraidīts

source: Last Used
lv: Pēdējo Reizi Izmantots

source: Payment Proof
lv: Maksājuma Apliecinājums

source: Submit Payment Proof
lv: Iesniegt Maksājuma Apliecinājumu

# paymentProofDescription
source: Upload proof of your payment to complete the transaction.
lv: Augšupielādējiet savas maksājuma apliecinājumu, lai pabeigtu transakciju.

# paymentProofSecurityNote
source: Your proof will be securely stored on IPFS and only shared with the transaction counterparty.
lv: Jūsu apliecinājums tiks droši glabāts IPFS un koplietots tikai ar transakcijas otru pusi.

source: Select Proof Type
lv: Izvēlieties Apliecinājuma Veidu

source: Receipt
lv: Čeks

source: Transaction ID
lv: Transakcijas ID

source: Photo
lv: Foto

source: Confirmation
lv: Apstiprinājums

source: Upload Proof
lv: Augšupielādēt Apliecinājumu

source: Upload Receipt or Photo
lv: Augšupielādēt Čeku vai Foto

# uploadInstructions
source: Take a photo or upload a receipt/transaction confirmation
lv: Uzņemiet foto vai augšupielādējiet čeku/transakcijas apstiprinājumu

source: Retake
lv: Noņemt vēlreiz

source: Choose Another
lv: Izvēlēties citu

source: Transaction Details
lv: Transakcijas Detaļas

# transactionIdHint
source: Enter transaction ID (if applicable)
lv: Ievadiet transakcijas ID (ja piemērojams)

# transactionIdRequired
source: Transaction ID is required
lv: Transakcijas ID ir obligāts

source: Additional Notes
lv: Papildu Piezīmes

# additionalNotesHint
source: Any additional information (optional)
lv: Jebkura papildu informācija (neobligāts)

source: Submit Proof
lv: Iesniegt Apliecinājumu

# pleaseUploadImage
source: Please upload an image as proof
lv: Lūdzu augšupielādējiet attēlu kā apliecinājumu

# imagePickerError
source: Error selecting image
lv: Kļūda atlasot attēlu

# paymentProofSubmitted
source: Payment proof submitted successfully
lv: Maksājuma apliecinājums veiksmīgi iesniegts

# paymentProofSubmitError
source: Failed to submit payment proof
lv: Neizdevās iesniegt maksājuma apliecinājumu

# buyFlowTitle
source: Buy Listing
lv: Pirkt sludinājumu

# buyFlowCancelButton
source: Cancel
lv: Atcelt

# buyFlowErrorMessage
source: An error occurred during the buy process
lv: Izpildot pirkumu radās kļūda

# buyFlowErrorRetry
source: Retry
lv: Mēģināt vēlreiz

# buyFlowPriceTitle
source: Confirm Price
lv: Apstiprināt cenu

# buyFlowPriceDescription
source: Review the current price and cryptocurrency conversion rate before proceeding.
lv: Pirms turpināt, pārskatiet pašreizējo cenu un kriptovalūtas konversijas kursu.

# buyFlowConfirmTitle
source: Confirm Purchase
lv: Apstiprināt pirkumu

# buyFlowConfirmDescription
source: Please review your purchase details below before proceeding to payment.
lv: Lūdzu pārskatiet savas pirkuma detaļas zemāk pirms turpināt ar maksājumu.

# buyFlowConfirmListing
source: Listing
lv: Sludinājums

# buyFlowConfirmSeller
source: Seller
lv: Pārdevējs

# buyFlowUsdAmount
source: USD Amount
lv: USD summa

# buyFlowCryptoAmount
source: Crypto Amount
lv: Kripto summa

# buyFlowPaymentTitle
source: Secure Payment
lv: Drošs maksājums

# buyFlowPaymentDescription
source: Your payment will be secured through an atomic swap contract to protect both buyer and seller.
lv: Jūsu maksājums tiks nodrošināts caur atomārās apmaiņas līgumu, lai aizsargātu gan pircēju, gan pārdevēju.

# buyFlowPaymentGenerating
source: Generating secure payment...
lv: Ģenerē drošu maksājumu...

# buyFlowConfirmButton
source: Confirm Purchase
lv: Apstiprināt pirkumu

# buyFlowCompleteTitle
source: Purchase Successful
lv: Pirkums veiksmīgs

# buyFlowCompleteSuccess
source: Your purchase has been initiated successfully!
lv: Jūsu pirkums ir veiksmīgi uzsākts!

# buyFlowCompleteSwapCreated
source: Swap ID: {swapId}
lv: Apmaiņas ID: {swapId}

# buyFlowCompleteNextSteps
source: Next Steps
lv: Nākamās darbības

# buyFlowCompleteStep1
source: Contact {seller} to arrange payment
lv: Sazinieties ar {seller}, lai vienotu maksājuma detaļas

# buyFlowCompleteStep2
source: Complete payment and submit proof
lv: Veiciet maksājumu un iesniedziet apliecinājumu

# buyFlowCompleteStep3
source: Seller will release cryptocurrency upon payment confirmation
lv: Pārdevējs atbrīvos kriptovalūtu pēc maksājuma apstiprināšanas

# buyFlowBackButton
source: Back
lv: Atpakaļ

# buyFlowNextButton
source: Next
lv: Tālāk

# buyFlowErrorTitle
source: Error
lv: Kļūda

# buyFlowErrorCancel
source: Cancel
lv: Atcelt

# buyFlowStepPrice
source: Price
lv: Cena

# buyFlowStepConfirm
source: Confirm
lv: Apstiprināt

# buyFlowStepPayment
source: Payment
lv: Maksājums

# buyFlowStepCompletion
source: Complete
lv: Pabeigt

# buyFlowRefreshButton
source: Refresh
lv: Atjaunot

# buyFlowExchangeRate
source: Exchange Rate
lv: Mainīgais kurss

# buyFlowPriceStaleWarning
source: Price may be stale. Tap refresh to update.
lv: Cena var būt novecojusi. Pieskarieties, lai atjauninātu.

# buyFlowLastUpdated
source: Last Updated
lv: Pēdējoreiz atjaunināts
